In [ ]:
import pandas as pd



data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, None],
    "Sex":['Female','Male','Male'],
    'City': ['Mumbai', 'Pune', 'Delhi']
}

df = pd.DataFrame(data)
print(df)

# # df.isnull()  
# df.dropna()           # Drop rows with missing 
df.fillna(5)          # Fill missing with 0

      Name   Age     Sex    City
0    Alice  25.0  Female  Mumbai
1      Bob  30.0    Male    Pune
2  Charlie   NaN    Male   Delhi

      Name   Age     Sex    City
0    Alice  25.0  Female  Mumbai
1      Bob  30.0    Male    Pune
2  Charlie   5.0    Male   Delhi